{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"dense_218_input": {"name": "dense_218_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"dense_223": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_13/dense_218/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_218/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_223/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_223/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "dense_218_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_218/BiasAdd", "op": "_FusedMatMul", "input": ["dense_218_input", "StatefulPartitionedCall/sequential_13/dense_218/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_218/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13/dense_218/BiasAdd", "StatefulPartitionedCall/sequential_13/dense_219/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_219/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_13/dense_219/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13/dense_219/Sigmoid", "StatefulPartitionedCall/sequential_13/dense_220/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_220/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_13/dense_220/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13/dense_220/Sigmoid", "StatefulPartitionedCall/sequential_13/dense_221/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_221/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_13/dense_221/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13/dense_221/Sigmoid", "StatefulPartitionedCall/sequential_13/dense_222/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_222/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_13/dense_222/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_13/dense_223/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_13/dense_222/Sigmoid", "StatefulPartitionedCall/sequential_13/dense_223/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_13/dense_223/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_13/dense_223/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_13/dense_218/MatMul/ReadVariableOp", "shape": [3, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_218/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/MatMul/ReadVariableOp", "shape": [3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_219/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_220/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_221/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/MatMul/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_222/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_223/MatMul/ReadVariableOp", "shape": [16, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_13/dense_223/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}